INSERT INTO authors(name, birth_year) VALUES 
    ('М.А.Булгаков', 1891),
    ('А.С.Пушкин', 1799),
    ('М.Ю.Лермонтов', 1814);

INSERT INTO books (title, author_id, publication_year, genre) VALUES
    ('Мастер и Маргарита', 1, 1966, 'Роман'),
    ('Собачье сердце', 1, 1925, 'Повесть'),
    ('Белая гвардия', 1, 1925, 'Роман'),
    ('Евгений Онегин', 2, 1833, 'Роман в стихах'),
    ('Капитанская дочка', 2, 1836, 'Повесть'),
    ('Руслан и Людмила', 2, 1820, 'Поэма'),
    ('Герой нашего времени', 3, 1840, 'Роман'),
    ('Мцыри', 3, 1840, 'Поэма'),
    ('Демон', 3, 1842, 'Поэма');

INSERT INTO users(name, registration_date) VALUES 
    ('Заур', '2020-12-20'),
    ('Андрей', '2021-08-14'),
    ('Артем', '2020-02-02');

INSERT INTO borrowed_books (user_id, book_id, borrow_date, return_date) VALUES
    (1, 1, '2025-10-10', '2025-12-01'),
    (1, 4, '2025-10-1', '2025-10-10'),
    (1, 9, '2025-10-24', '2025-11-08'),
    
    (2, 2, '2025-10-10', '2025-12-10'),
    (2, 5, '2025-10-1', '2025-10-10'),
    
    (3, 1, '2025-10-10', '2026-01-01'),
    (3, 9, '2025-10-1', '2025-11-08');
